[Survived] BlockStatement
src/utils/headers.ts:3:68
 import { AxiosInstance } from 'axios';
 
-export const setCommonHeaders = (instance: AxiosInstance): void => {
-  instance.defaults.headers.common['Content-Type'] = 'application/json';
-  instance.defaults.headers.common['Accept'] = 'application/json';
-
-  // Si tienes un token de autenticación, puedes agregarlo así:
-  const token = localStorage.getItem('token');
-  if (token) {
-    instance.defaults.headers.common['Authorization'] = `Bearer ${token}`;
-  }
-
-  // Otros encabezados comunes que quieras agregar
-  instance.defaults.headers.common['Custom-Header'] = 'customValue';
-};
+export const setCommonHeaders = (instance: AxiosInstance): void => {};
 

[Survived] StringLiteral
src/utils/headers.ts:5:48
 
 export const setCommonHeaders = (instance: AxiosInstance): void => {
   instance.defaults.headers.common['Content-Type'] = 'application/json';
-  instance.defaults.headers.common['Accept'] = 'application/json';
+  instance.defaults.headers.common['Accept'] = "";
 
   // Si tienes un token de autenticación, puedes agregarlo así:

[Survived] StringLiteral
src/utils/headers.ts:8:38
   instance.defaults.headers.common['Accept'] = 'application/json';
 
   // Si tienes un token de autenticación, puedes agregarlo así:
-  const token = localStorage.getItem('token');
+  const token = localStorage.getItem("");
   if (token) {
     instance.defaults.headers.common['Authorization'] = `Bearer ${token}`;

[NoCoverage] BlockStatement
src/utils/headers.ts:9:14
 
   // Si tienes un token de autenticación, puedes agregarlo así:
   const token = localStorage.getItem('token');
-  if (token) {
-    instance.defaults.headers.common['Authorization'] = `Bearer ${token}`;
-  }
+  if (token) {}
 
   // Otros encabezados comunes que quieras agregar
