[Killed] EqualityOperator
src/hooks/useAxios.ts:34:7
 }
 
 export const useAxios = <T>(config: Config): UseAxios<T> => {
-  if (config === undefined)
+  if (config !== undefined)
     throw new Error("useAxios must be initialized with config params");
   if (config.instance === undefined)
killedBy: useAxios throw error if config is undefined
statusReason: expected 'Cannot read properties of undefined (…' to be 'useAxios must be initialized with con…' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useAxios.ts:34:7
 }
 
 export const useAxios = <T>(config: Config): UseAxios<T> => {
-  if (config === undefined)
+  if (true)
     throw new Error("useAxios must be initialized with config params");
   if (config.instance === undefined)
killedBy: useAxios throw error if the config missing a parameter instance
statusReason: expected 'useAxios must be initialized with con…' to be 'useAxios must be initialized with an …' // Object.is equality

[Killed] EqualityOperator
src/hooks/useAxios.ts:36:7
 export const useAxios = <T>(config: Config): UseAxios<T> => {
   if (config === undefined)
     throw new Error("useAxios must be initialized with config params");
-  if (config.instance === undefined)
+  if (config.instance !== undefined)
     throw new Error("useAxios must be initialized with an instance of axios");
 
killedBy: useAxios throw error if the config missing a parameter instance
statusReason: expected 'Cannot read properties of undefined (…' to be 'useAxios must be initialized with an …' // Object.is equality

[Killed] ConditionalExpression
src/hooks/useAxios.ts:36:7
 export const useAxios = <T>(config: Config): UseAxios<T> => {
   if (config === undefined)
     throw new Error("useAxios must be initialized with config params");
-  if (config.instance === undefined)
+  if (false)
     throw new Error("useAxios must be initialized with an instance of axios");
 
killedBy: useAxios throw error if the config missing a parameter instance
statusReason: expected 'Cannot read properties of undefined (…' to be 'useAxios must be initialized with an …' // Object.is equality

[Killed] StringLiteral
src/hooks/useAxios.ts:37:21
   if (config === undefined)
     throw new Error("useAxios must be initialized with config params");
   if (config.instance === undefined)
-    throw new Error("useAxios must be initialized with an instance of axios");
+    throw new Error("");
 
   const configRef = useRef(config);
killedBy: useAxios throw error if the config missing a parameter instance
statusReason: expected '' to be 'useAxios must be initialized with an …' // Object.is equality

[Survived] LogicalOperator
src/hooks/useAxios.ts:46:51
 
   const [response, setResponse] = useState<T | null>(null);
   const [error, setError] = useState<Error>("");
-  const [loading, setLoading] = useState<boolean>(config.enabled ?? false);
+  const [loading, setLoading] = useState<boolean>(config.enabled && false);
   const requestInterceptorRef = useRef<number | null>(null);
 

[NoCoverage] BooleanLiteral
src/hooks/useAxios.ts:46:69
 
   const [response, setResponse] = useState<T | null>(null);
   const [error, setError] = useState<Error>("");
-  const [loading, setLoading] = useState<boolean>(config.enabled ?? false);
+  const [loading, setLoading] = useState<boolean>(config.enabled ?? true);
   const requestInterceptorRef = useRef<number | null>(null);
 

[Killed] BlockStatement
src/hooks/useAxios.ts:49:19
   const [loading, setLoading] = useState<boolean>(config.enabled ?? false);
   const requestInterceptorRef = useRef<number | null>(null);
 
-  useEffect(() => {
-    const requestInterceptor = instance.interceptors.response.use(
-      (response) => {
-        if (response.status === 200 && config?.onSucessCallback) {
-          config.onSucessCallback();
-        }
-        return response;
-      },
-      async (error) => {
-        if (error.response.status === 500 && config?.onErrorCallback) {
-          config.onErrorCallback();
-        }
-        if (error.response.status === 401 && config?.onUnauthorizedCallback) {
-          config.onUnauthorizedCallback();
-        }
-        return await Promise.reject(error);
-      }
-    );
-    requestInterceptorRef.current = requestInterceptor;
-    return () => {
-      instance.interceptors.response.eject(requestInterceptor);
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   function newAbortSignal() {
killedBy: useAxios calls onSuccessCallback on successful response
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useAxios.ts:51:21
 
   useEffect(() => {
     const requestInterceptor = instance.interceptors.response.use(
-      (response) => {
-        if (response.status === 200 && config?.onSucessCallback) {
-          config.onSucessCallback();
-        }
-        return response;
-      },
+      (response) => {},
       async (error) => {
         if (error.response.status === 500 && config?.onErrorCallback) {
killedBy: useAxios handles response correctly
statusReason: expected null to deeply equal { data: 'test' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useAxios.ts:52:13
   useEffect(() => {
     const requestInterceptor = instance.interceptors.response.use(
       (response) => {
-        if (response.status === 200 && config?.onSucessCallback) {
+        if (true) {
           config.onSucessCallback();
         }
killedBy: useAxios handles response correctly
statusReason: expected null to deeply equal { data: 'test' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useAxios.ts:52:13
   useEffect(() => {
     const requestInterceptor = instance.interceptors.response.use(
       (response) => {
-        if (response.status === 200 && config?.onSucessCallback) {
+        if (false) {
           config.onSucessCallback();
         }
killedBy: useAxios calls onSuccessCallback on successful response
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useAxios.ts:57:24
         }
         return response;
       },
-      async (error) => {
-        if (error.response.status === 500 && config?.onErrorCallback) {
-          config.onErrorCallback();
-        }
-        if (error.response.status === 401 && config?.onUnauthorizedCallback) {
-          config.onUnauthorizedCallback();
-        }
-        return await Promise.reject(error);
-      }
+      async (error) => {}
     );
     requestInterceptorRef.current = requestInterceptor;
killedBy: useAxios calls onErrorCallback on error response
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/hooks/useAxios.ts:58:13
         return response;
       },
       async (error) => {
-        if (error.response.status === 500 && config?.onErrorCallback) {
+        if (error.response.status !== 500 && config?.onErrorCallback) {
           config.onErrorCallback();
         }
killedBy: useAxios calls onErrorCallback on error response
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useAxios.ts:58:13
         return response;
       },
       async (error) => {
-        if (error.response.status === 500 && config?.onErrorCallback) {
+        if (false) {
           config.onErrorCallback();
         }
killedBy: useAxios calls onErrorCallback on error response
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ConditionalExpression
src/hooks/useAxios.ts:61:13
         if (error.response.status === 500 && config?.onErrorCallback) {
           config.onErrorCallback();
         }
-        if (error.response.status === 401 && config?.onUnauthorizedCallback) {
+        if (false) {
           config.onUnauthorizedCallback();
         }

[NoCoverage] BlockStatement
src/hooks/useAxios.ts:61:78
         if (error.response.status === 500 && config?.onErrorCallback) {
           config.onErrorCallback();
         }
-        if (error.response.status === 401 && config?.onUnauthorizedCallback) {
-          config.onUnauthorizedCallback();
-        }
+        if (error.response.status === 401 && config?.onUnauthorizedCallback) {}
         return await Promise.reject(error);
       }

[Survived] BlockStatement
src/hooks/useAxios.ts:68:18
       }
     );
     requestInterceptorRef.current = requestInterceptor;
-    return () => {
-      instance.interceptors.response.eject(requestInterceptor);
-    };
+    return () => {};
   }, []);
 

[Survived] BlockStatement
src/hooks/useAxios.ts:73:29
     };
   }, []);
 
-  function newAbortSignal() {
-    const abortController = new AbortController();
-    setTimeout(() => abortController.abort(), config.timeout ?? 5000);
-    return abortController.signal;
-  }
+  function newAbortSignal() {}
 
   const errorHandler = (e: unknown): void => {

[Survived] LogicalOperator
src/hooks/useAxios.ts:75:47
 
   function newAbortSignal() {
     const abortController = new AbortController();
-    setTimeout(() => abortController.abort(), config.timeout ?? 5000);
+    setTimeout(() => abortController.abort(), config.timeout && 5000);
     return abortController.signal;
   }

[Survived] ArrowFunction
src/hooks/useAxios.ts:75:16
 
   function newAbortSignal() {
     const abortController = new AbortController();
-    setTimeout(() => abortController.abort(), config.timeout ?? 5000);
+    setTimeout(() => undefined, config.timeout ?? 5000);
     return abortController.signal;
   }

[Killed] BlockStatement
src/hooks/useAxios.ts:79:46
     return abortController.signal;
   }
 
-  const errorHandler = (e: unknown): void => {
-    if (e instanceof AxiosError) {
-      setError(e.message);
-    } else {
-      setError("Request failed with status code 500");
-    }
-  };
+  const errorHandler = (e: unknown): void => {};
 
   const fetch = useCallback(
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ConditionalExpression
src/hooks/useAxios.ts:80:9
   }
 
   const errorHandler = (e: unknown): void => {
-    if (e instanceof AxiosError) {
+    if (true) {
       setError(e.message);
     } else {

[Survived] ConditionalExpression
src/hooks/useAxios.ts:80:9
   }
 
   const errorHandler = (e: unknown): void => {
-    if (e instanceof AxiosError) {
+    if (false) {
       setError(e.message);
     } else {

[Killed] BlockStatement
src/hooks/useAxios.ts:82:12
   const errorHandler = (e: unknown): void => {
     if (e instanceof AxiosError) {
       setError(e.message);
-    } else {
-      setError("Request failed with status code 500");
-    }
+    } else {}
   };
 
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] LogicalOperator
src/hooks/useAxios.ts:88:46
   };
 
   const fetch = useCallback(
-    async (config: Config, retries: number = config.retryCount ?? 0) => {
+    async (config: Config, retries: number = config.retryCount && 0) => {
       try {
         const enabled = config.enabled;

[Killed] BlockStatement
src/hooks/useAxios.ts:89:11
 
   const fetch = useCallback(
     async (config: Config, retries: number = config.retryCount ?? 0) => {
-      try {
-        const enabled = config.enabled;
-        if (enabled === false) return;
-        setLoading(true);
-        const res = await instance.request<T>({
-          ...config,
-          method: config.method.toLowerCase(),
-          signal: newAbortSignal(),
-          headers: {
-            ...config.headers,
-          },
-        });
-        setResponse(res.data);
-      } catch (e) {
+      try {} catch (e) {
         if (retries > 0) {
           setTimeout(
killedBy: useAxios sets loading state correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/hooks/useAxios.ts:91:13
     async (config: Config, retries: number = config.retryCount ?? 0) => {
       try {
         const enabled = config.enabled;
-        if (enabled === false) return;
+        if (true) return;
         setLoading(true);
         const res = await instance.request<T>({
killedBy: useAxios sets loading state correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useAxios.ts:91:25
     async (config: Config, retries: number = config.retryCount ?? 0) => {
       try {
         const enabled = config.enabled;
-        if (enabled === false) return;
+        if (enabled === true) return;
         setLoading(true);
         const res = await instance.request<T>({
killedBy: useAxios sets loading state correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useAxios.ts:92:20
       try {
         const enabled = config.enabled;
         if (enabled === false) return;
-        setLoading(true);
+        setLoading(false);
         const res = await instance.request<T>({
           ...config,
killedBy: useAxios sets loading state correctly
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/hooks/useAxios.ts:93:47
         const enabled = config.enabled;
         if (enabled === false) return;
         setLoading(true);
-        const res = await instance.request<T>({
-          ...config,
-          method: config.method.toLowerCase(),
-          signal: newAbortSignal(),
-          headers: {
-            ...config.headers,
-          },
-        });
+        const res = await instance.request<T>({});
         setResponse(res.data);
       } catch (e) {
killedBy: useAxios handles response correctly
statusReason: expected null to deeply equal { data: 'test' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] MethodExpression
src/hooks/useAxios.ts:95:19
         setLoading(true);
         const res = await instance.request<T>({
           ...config,
-          method: config.method.toLowerCase(),
+          method: config.method.toUpperCase(),
           signal: newAbortSignal(),
           headers: {

[Killed] BlockStatement
src/hooks/useAxios.ts:102:19
           },
         });
         setResponse(res.data);
-      } catch (e) {
-        if (retries > 0) {
-          setTimeout(
-            () => fetch(config, retries - 1),
-            config.retryDelay ?? 1000
-          );
-        } else {
-          errorHandler(e);
-        }
-      } finally {
+      } catch (e) {} finally {
         setLoading(false);
       }
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useAxios.ts:103:13
         });
         setResponse(res.data);
       } catch (e) {
-        if (retries > 0) {
+        if (true) {
           setTimeout(
             () => fetch(config, retries - 1),
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/hooks/useAxios.ts:103:13
         });
         setResponse(res.data);
       } catch (e) {
-        if (retries > 0) {
+        if (retries <= 0) {
           setTimeout(
             () => fetch(config, retries - 1),
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] ArrowFunction
src/hooks/useAxios.ts:105:13
       } catch (e) {
         if (retries > 0) {
           setTimeout(
-            () => fetch(config, retries - 1),
+            () => undefined,
             config.retryDelay ?? 1000
           );

[NoCoverage] ArithmeticOperator
src/hooks/useAxios.ts:105:33
       } catch (e) {
         if (retries > 0) {
           setTimeout(
-            () => fetch(config, retries - 1),
+            () => fetch(config, retries + 1),
             config.retryDelay ?? 1000
           );

[NoCoverage] LogicalOperator
src/hooks/useAxios.ts:106:13
         if (retries > 0) {
           setTimeout(
             () => fetch(config, retries - 1),
-            config.retryDelay ?? 1000
+            config.retryDelay && 1000
           );
         } else {

[Killed] BlockStatement
src/hooks/useAxios.ts:108:16
             () => fetch(config, retries - 1),
             config.retryDelay ?? 1000
           );
-        } else {
-          errorHandler(e);
-        }
+        } else {}
       } finally {
         setLoading(false);
killedBy: useAxios handles error correctly
statusReason: expected '' to be 'Request failed with status code 500' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] ArrayDeclaration
src/hooks/useAxios.ts:115:5
         setLoading(false);
       }
     },
-    [instance]
+    []
   );
 

[NoCoverage] BlockStatement
src/hooks/useAxios.ts:119:32
   );
 
   const fetcher = useCallback(
-    async (_config: Config) => {
-      try {
-        const response = await instance.request<T>({
-          ...configRef.current,
-          ..._config,
-        });
-        return response.data;
-      } catch (e) {
-        errorHandler(e);
-        return undefined;
-      }
-    },
+    async (_config: Config) => {},
     [instance]
   );

[NoCoverage] BlockStatement
src/hooks/useAxios.ts:120:11
 
   const fetcher = useCallback(
     async (_config: Config) => {
-      try {
-        const response = await instance.request<T>({
-          ...configRef.current,
-          ..._config,
-        });
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         errorHandler(e);
         return undefined;

[NoCoverage] BlockStatement
src/hooks/useAxios.ts:126:19
           ..._config,
         });
         return response.data;
-      } catch (e) {
-        errorHandler(e);
-        return undefined;
-      }
+      } catch (e) {}
     },
     [instance]

[Killed] BlockStatement
src/hooks/useAxios.ts:134:30
     [instance]
   );
 
-  useDeepCompareEffect(() => {
-    void fetch(configRef.current);
-  }, [config]);
+  useDeepCompareEffect(() => {}, [config]);
 
   useEffect(() => {
killedBy: useAxios sets loading state correctly
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Survived] BlockStatement
src/hooks/useAxios.ts:138:19
     void fetch(configRef.current);
   }, [config]);
 
-  useEffect(() => {
-    return () => {
-      if (requestInterceptorRef.current !== null) {
-        instance.interceptors.response.eject(requestInterceptorRef.current);
-      }
-    };
-  }, [instance]);
+  useEffect(() => {}, [instance]);
 
   return {

[Survived] BlockStatement
src/hooks/useAxios.ts:139:18
   }, [config]);
 
   useEffect(() => {
-    return () => {
-      if (requestInterceptorRef.current !== null) {
-        instance.interceptors.response.eject(requestInterceptorRef.current);
-      }
-    };
+    return () => {};
   }, [instance]);
 

[Survived] BlockStatement
src/hooks/useAxios.ts:140:51
 
   useEffect(() => {
     return () => {
-      if (requestInterceptorRef.current !== null) {
-        instance.interceptors.response.eject(requestInterceptorRef.current);
-      }
+      if (requestInterceptorRef.current !== null) {}
     };
   }, [instance]);

[Survived] EqualityOperator
src/hooks/useAxios.ts:140:11
 
   useEffect(() => {
     return () => {
-      if (requestInterceptorRef.current !== null) {
+      if (requestInterceptorRef.current === null) {
         instance.interceptors.response.eject(requestInterceptorRef.current);
       }

[Survived] ArrayDeclaration
src/hooks/useAxios.ts:144:6
         instance.interceptors.response.eject(requestInterceptorRef.current);
       }
     };
-  }, [instance]);
+  }, []);
 
   return {

[Killed] ObjectLiteral
src/hooks/useAxios.ts:146:10
     };
   }, [instance]);
 
-  return {
-    data: response,
-    error,
-    loading,
-    fetcher,
-  };
+  return {};
 };
 
killedBy: useAxios sets loading state correctly
statusReason: expected undefined to be true // Object.is equality
