[Survived] BooleanLiteral
src/hooks/useClipboard.ts:4:44
 import { useState, useCallback } from "react";
 
 export const useClipboard = () => {
-  const [isCopied, setIsCopied] = useState(false);
+  const [isCopied, setIsCopied] = useState(true);
   const copyToClipboard = useCallback((text: string) => {
     if (navigator.clipboard && window.isSecureContext) {

[Survived] ConditionalExpression
src/hooks/useClipboard.ts:6:9
 export const useClipboard = () => {
   const [isCopied, setIsCopied] = useState(false);
   const copyToClipboard = useCallback((text: string) => {
-    if (navigator.clipboard && window.isSecureContext) {
+    if (false) {
       navigator.clipboard
         .writeText(text)

[Survived] ConditionalExpression
src/hooks/useClipboard.ts:6:9
 export const useClipboard = () => {
   const [isCopied, setIsCopied] = useState(false);
   const copyToClipboard = useCallback((text: string) => {
-    if (navigator.clipboard && window.isSecureContext) {
+    if (true) {
       navigator.clipboard
         .writeText(text)

[NoCoverage] BlockStatement
src/hooks/useClipboard.ts:9:21
     if (navigator.clipboard && window.isSecureContext) {
       navigator.clipboard
         .writeText(text)
-        .then(() => {
-          setIsCopied(true);
-        })
+        .then(() => {})
         .catch(() => {
           setIsCopied(false);

[NoCoverage] BooleanLiteral
src/hooks/useClipboard.ts:10:23
       navigator.clipboard
         .writeText(text)
         .then(() => {
-          setIsCopied(true);
+          setIsCopied(false);
         })
         .catch(() => {

[NoCoverage] BlockStatement
src/hooks/useClipboard.ts:12:22
         .then(() => {
           setIsCopied(true);
         })
-        .catch(() => {
-          setIsCopied(false);
-        });
+        .catch(() => {});
     } else {
       // Fallback for browsers that don't support navigator.clipboard

[NoCoverage] BooleanLiteral
src/hooks/useClipboard.ts:13:23
           setIsCopied(true);
         })
         .catch(() => {
-          setIsCopied(false);
+          setIsCopied(true);
         });
     } else {

[Survived] BlockStatement
src/hooks/useClipboard.ts:15:12
         .catch(() => {
           setIsCopied(false);
         });
-    } else {
-      // Fallback for browsers that don't support navigator.clipboard
-      const textArea = document.createElement("textarea");
-      textArea.value = text;
-      document.body.appendChild(textArea);
-      textArea.select();
-      try {
-        document.execCommand("copy");
-        setIsCopied(true);
-      } catch (err) {
-        setIsCopied(false);
-      } finally {
-        document.body.removeChild(textArea);
-      }
-    }
+    } else {}
   }, []);
   return { isCopied, copyToClipboard };

[Survived] BlockStatement
src/hooks/useClipboard.ts:21:11
       textArea.value = text;
       document.body.appendChild(textArea);
       textArea.select();
-      try {
-        document.execCommand("copy");
-        setIsCopied(true);
-      } catch (err) {
+      try {} catch (err) {
         setIsCopied(false);
       } finally {

[NoCoverage] BooleanLiteral
src/hooks/useClipboard.ts:23:21
       textArea.select();
       try {
         document.execCommand("copy");
-        setIsCopied(true);
+        setIsCopied(false);
       } catch (err) {
         setIsCopied(false);

[Survived] BlockStatement
src/hooks/useClipboard.ts:24:21
       try {
         document.execCommand("copy");
         setIsCopied(true);
-      } catch (err) {
-        setIsCopied(false);
-      } finally {
+      } catch (err) {} finally {
         document.body.removeChild(textArea);
       }

[Killed] BooleanLiteral
src/hooks/useClipboard.ts:25:21
         document.execCommand("copy");
         setIsCopied(true);
       } catch (err) {
-        setIsCopied(false);
+        setIsCopied(true);
       } finally {
         document.body.removeChild(textArea);
killedBy: useClipboard should handle clipboard write failure gracefully
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/hooks/useClipboard.ts:26:17
         setIsCopied(true);
       } catch (err) {
         setIsCopied(false);
-      } finally {
-        document.body.removeChild(textArea);
-      }
+      } finally {}
     }
   }, []);
