[Killed] BlockStatement
src/hooks/useHover.ts:3:21
 import { useState, useRef, useEffect } from "react";
 
-function useHover() {
-  const [isHovered, setIsHovered] = useState(false);
-  const ref = useRef<HTMLElement | null>(null);
-
-  useEffect(() => {
-    const node = ref.current;
-    if (node) {
-      const handleMouseEnter = () => setIsHovered(true);
-      const handleMouseLeave = () => setIsHovered(false);
-      node.addEventListener("mouseenter", handleMouseEnter);
-      node.addEventListener("mouseleave", handleMouseLeave);
-      return () => {
-        node.removeEventListener("mouseenter", handleMouseEnter);
-        node.removeEventListener("mouseleave", handleMouseLeave);
-      };
-    }
-  }, []);
-  return [ref, isHovered] as const;
-}
+function useHover() {}
 
 export default useHover;
killedBy: useHover should not change state if no events are triggered
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
src/hooks/useHover.ts:4:46
 import { useState, useRef, useEffect } from "react";
 
 function useHover() {
-  const [isHovered, setIsHovered] = useState(false);
+  const [isHovered, setIsHovered] = useState(true);
   const ref = useRef<HTMLElement | null>(null);
 
killedBy: useHover should not change state if no events are triggered
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/hooks/useHover.ts:7:19
   const [isHovered, setIsHovered] = useState(false);
   const ref = useRef<HTMLElement | null>(null);
 
-  useEffect(() => {
-    const node = ref.current;
-    if (node) {
-      const handleMouseEnter = () => setIsHovered(true);
-      const handleMouseLeave = () => setIsHovered(false);
-      node.addEventListener("mouseenter", handleMouseEnter);
-      node.addEventListener("mouseleave", handleMouseLeave);
-      return () => {
-        node.removeEventListener("mouseenter", handleMouseEnter);
-        node.removeEventListener("mouseleave", handleMouseLeave);
-      };
-    }
-  }, []);
+  useEffect(() => {}, []);
   return [ref, isHovered] as const;
 }

[Killed] ConditionalExpression
src/hooks/useHover.ts:9:9
 
   useEffect(() => {
     const node = ref.current;
-    if (node) {
+    if (true) {
       const handleMouseEnter = () => setIsHovered(true);
       const handleMouseLeave = () => setIsHovered(false);
killedBy: useHover should not change state if no events are triggered
statusReason: Cannot read properties of null (reading 'addEventListener')

[NoCoverage] BlockStatement
src/hooks/useHover.ts:9:15
 
   useEffect(() => {
     const node = ref.current;
-    if (node) {
-      const handleMouseEnter = () => setIsHovered(true);
-      const handleMouseLeave = () => setIsHovered(false);
-      node.addEventListener("mouseenter", handleMouseEnter);
-      node.addEventListener("mouseleave", handleMouseLeave);
-      return () => {
-        node.removeEventListener("mouseenter", handleMouseEnter);
-        node.removeEventListener("mouseleave", handleMouseLeave);
-      };
-    }
+    if (node) {}
   }, []);
   return [ref, isHovered] as const;

[NoCoverage] ArrowFunction
src/hooks/useHover.ts:10:32
   useEffect(() => {
     const node = ref.current;
     if (node) {
-      const handleMouseEnter = () => setIsHovered(true);
+      const handleMouseEnter = () => undefined;
       const handleMouseLeave = () => setIsHovered(false);
       node.addEventListener("mouseenter", handleMouseEnter);

[NoCoverage] BooleanLiteral
src/hooks/useHover.ts:10:51
   useEffect(() => {
     const node = ref.current;
     if (node) {
-      const handleMouseEnter = () => setIsHovered(true);
+      const handleMouseEnter = () => setIsHovered(false);
       const handleMouseLeave = () => setIsHovered(false);
       node.addEventListener("mouseenter", handleMouseEnter);

[NoCoverage] BlockStatement
src/hooks/useHover.ts:14:20
       const handleMouseLeave = () => setIsHovered(false);
       node.addEventListener("mouseenter", handleMouseEnter);
       node.addEventListener("mouseleave", handleMouseLeave);
-      return () => {
-        node.removeEventListener("mouseenter", handleMouseEnter);
-        node.removeEventListener("mouseleave", handleMouseLeave);
-      };
+      return () => {};
     }
   }, []);

[NoCoverage] StringLiteral
src/hooks/useHover.ts:15:34
       node.addEventListener("mouseenter", handleMouseEnter);
       node.addEventListener("mouseleave", handleMouseLeave);
       return () => {
-        node.removeEventListener("mouseenter", handleMouseEnter);
+        node.removeEventListener("", handleMouseEnter);
         node.removeEventListener("mouseleave", handleMouseLeave);
       };

[NoCoverage] StringLiteral
src/hooks/useHover.ts:16:34
       node.addEventListener("mouseleave", handleMouseLeave);
       return () => {
         node.removeEventListener("mouseenter", handleMouseEnter);
-        node.removeEventListener("mouseleave", handleMouseLeave);
+        node.removeEventListener("", handleMouseLeave);
       };
     }
