[NoCoverage] StringLiteral
src/hooks/useInfiniteScroll.ts:14:16
 
 function useInfiniteScroll({
   root = null,
-  rootMargin = "0px",
+  rootMargin = "",
   threshold = 0.1,
   hasMore,

[Killed] ConditionalExpression
src/hooks/useInfiniteScroll.ts:24:9
   const observerRef = useRef<IntersectionObserver | null>(null);
 
   useEffect(() => {
-    if (loading) return;
+    if (true) return;
 
     if (!observerRef.current) {
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Survived] ConditionalExpression
src/hooks/useInfiniteScroll.ts:24:9
   const observerRef = useRef<IntersectionObserver | null>(null);
 
   useEffect(() => {
-    if (loading) return;
+    if (false) return;
 
     if (!observerRef.current) {

[Killed] BooleanLiteral
src/hooks/useInfiniteScroll.ts:26:9
   useEffect(() => {
     if (loading) return;
 
-    if (!observerRef.current) {
+    if (observerRef.current) {
       observerRef.current = new IntersectionObserver(
         (entries) => {
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: Cannot read properties of null (reading 'observe')

[Killed] ConditionalExpression
src/hooks/useInfiniteScroll.ts:26:9
   useEffect(() => {
     if (loading) return;
 
-    if (!observerRef.current) {
+    if (false) {
       observerRef.current = new IntersectionObserver(
         (entries) => {
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: Cannot read properties of null (reading 'observe')

[Killed] BlockStatement
src/hooks/useInfiniteScroll.ts:28:22
 
     if (!observerRef.current) {
       observerRef.current = new IntersectionObserver(
-        (entries) => {
-          if (entries[0].isIntersecting && hasMore) {
-            loadMore();
-          }
-        },
+        (entries) => {},
         { root, rootMargin, threshold }
       );
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
src/hooks/useInfiniteScroll.ts:29:15
     if (!observerRef.current) {
       observerRef.current = new IntersectionObserver(
         (entries) => {
-          if (entries[0].isIntersecting && hasMore) {
+          if (false) {
             loadMore();
           }
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/hooks/useInfiniteScroll.ts:29:53
     if (!observerRef.current) {
       observerRef.current = new IntersectionObserver(
         (entries) => {
-          if (entries[0].isIntersecting && hasMore) {
-            loadMore();
-          }
+          if (entries[0].isIntersecting && hasMore) {}
         },
         { root, rootMargin, threshold }
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
src/hooks/useInfiniteScroll.ts:40:9
     const observer = observerRef.current;
     const sentinel = sentinelRef.current;
 
-    if (sentinel) {
+    if (false) {
       observer.observe(sentinel);
     }
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/hooks/useInfiniteScroll.ts:40:19
     const observer = observerRef.current;
     const sentinel = sentinelRef.current;
 
-    if (sentinel) {
-      observer.observe(sentinel);
-    }
+    if (sentinel) {}
 
     return () => {
killedBy: useInfiniteScroll should call loadMore when sentinel is intersecting
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/hooks/useInfiniteScroll.ts:44:18
       observer.observe(sentinel);
     }
 
-    return () => {
-      if (sentinel) {
-        observer.unobserve(sentinel);
-      }
-    };
+    return () => {};
   }, [loading, hasMore, loadMore, root, rootMargin, threshold]);
 
killedBy: useInfiniteScroll should unobserve when the component unmounts
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/hooks/useInfiniteScroll.ts:45:11
     }
 
     return () => {
-      if (sentinel) {
+      if (false) {
         observer.unobserve(sentinel);
       }
killedBy: useInfiniteScroll should unobserve when the component unmounts
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/hooks/useInfiniteScroll.ts:45:21
     }
 
     return () => {
-      if (sentinel) {
-        observer.unobserve(sentinel);
-      }
+      if (sentinel) {}
     };
   }, [loading, hasMore, loadMore, root, rootMargin, threshold]);
killedBy: useInfiniteScroll should unobserve when the component unmounts
statusReason: expected "spy" to be called at least once
