[Killed] BlockStatement
src/hooks/useLocalStorage.ts:3:59
 import { useState } from "react";
 
-function useLocalStorage<T>(key: string, initialValue: T) {
-  const [storedValue, setStoredValue] = useState<T>(() => {
-    try {
-      const item = window.localStorage.getItem(key);
-      return item ? JSON.parse(item) : initialValue;
-    } catch (error) {
-      console.error("Error reading from localStorage", error);
-      return initialValue;
-    }
-  });
-
-  const setValue = (value: T | ((val: T) => T)) => {
-    try {
-      const valueToStore =
-        value instanceof Function ? value(storedValue) : value;
-      setStoredValue(valueToStore);
-      window.localStorage.setItem(key, JSON.stringify(valueToStore));
-    } catch (error) {
-      console.error("Error setting localStorage value", error);
-    }
-  };
-
-  return [storedValue, setValue] as const;
-}
+function useLocalStorage<T>(key: string, initialValue: T) {}
 
 export default useLocalStorage;
killedBy: useLocalStorage should return the initial value if there is nothing in localStorage
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:4:59
 import { useState } from "react";
 
 function useLocalStorage<T>(key: string, initialValue: T) {
-  const [storedValue, setStoredValue] = useState<T>(() => {
-    try {
-      const item = window.localStorage.getItem(key);
-      return item ? JSON.parse(item) : initialValue;
-    } catch (error) {
-      console.error("Error reading from localStorage", error);
-      return initialValue;
-    }
-  });
+  const [storedValue, setStoredValue] = useState<T>(() => {});
 
   const setValue = (value: T | ((val: T) => T)) => {
killedBy: useLocalStorage should return the initial value if there is nothing in localStorage
statusReason: expected undefined to be 'initial' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:5:9
 
 function useLocalStorage<T>(key: string, initialValue: T) {
   const [storedValue, setStoredValue] = useState<T>(() => {
-    try {
-      const item = window.localStorage.getItem(key);
-      return item ? JSON.parse(item) : initialValue;
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error reading from localStorage", error);
       return initialValue;
killedBy: useLocalStorage should return the initial value if there is nothing in localStorage
statusReason: expected undefined to be 'initial' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:8:21
     try {
       const item = window.localStorage.getItem(key);
       return item ? JSON.parse(item) : initialValue;
-    } catch (error) {
-      console.error("Error reading from localStorage", error);
-      return initialValue;
-    }
+    } catch (error) {}
   });
 

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:14:52
     }
   });
 
-  const setValue = (value: T | ((val: T) => T)) => {
-    try {
-      const valueToStore =
-        value instanceof Function ? value(storedValue) : value;
-      setStoredValue(valueToStore);
-      window.localStorage.setItem(key, JSON.stringify(valueToStore));
-    } catch (error) {
-      console.error("Error setting localStorage value", error);
-    }
-  };
+  const setValue = (value: T | ((val: T) => T)) => {};
 
   return [storedValue, setValue] as const;
killedBy: useLocalStorage should store and retrieve the value of localStorage
statusReason: expected 'initial' to be 'newValue' // Object.is equality

[Killed] BlockStatement
src/hooks/useLocalStorage.ts:15:9
   });
 
   const setValue = (value: T | ((val: T) => T)) => {
-    try {
-      const valueToStore =
-        value instanceof Function ? value(storedValue) : value;
-      setStoredValue(valueToStore);
-      window.localStorage.setItem(key, JSON.stringify(valueToStore));
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error setting localStorage value", error);
     }
killedBy: useLocalStorage should store and retrieve the value of localStorage
statusReason: expected 'initial' to be 'newValue' // Object.is equality

[NoCoverage] BlockStatement
src/hooks/useLocalStorage.ts:20:21
         value instanceof Function ? value(storedValue) : value;
       setStoredValue(valueToStore);
       window.localStorage.setItem(key, JSON.stringify(valueToStore));
-    } catch (error) {
-      console.error("Error setting localStorage value", error);
-    }
+    } catch (error) {}
   };
 
