[Killed] BlockStatement
src/hooks/useEvent.ts:6:65
 // eslint-disable-next-line @typescript-eslint/no-explicit-any
 type AnyFunction = (...args: unknown[]) => any;
 
-export function useEvent<T extends AnyFunction>(callback: T): T {
-  const ref = useRef<T>(callback);
-
-  useEffect(() => {
-    ref.current = callback;
-  }, [callback]);
-
-  const memoizedCallback = useCallback(
-    (...args: Parameters<T>): ReturnType<T> => {
-      return ref.current(...args);
-    },
-    []
-  );
-
-  return memoizedCallback as unknown as T;
-}
+export function useEvent<T extends AnyFunction>(callback: T): T {}
 
killedBy: useEvent should execute the main callback
statusReason: result.current is not a function

[Survived] BlockStatement
src/hooks/useEvent.ts:9:19
 export function useEvent<T extends AnyFunction>(callback: T): T {
   const ref = useRef<T>(callback);
 
-  useEffect(() => {
-    ref.current = callback;
-  }, [callback]);
+  useEffect(() => {}, [callback]);
 
   const memoizedCallback = useCallback(

[Killed] BlockStatement
src/hooks/useEvent.ts:14:48
   }, [callback]);
 
   const memoizedCallback = useCallback(
-    (...args: Parameters<T>): ReturnType<T> => {
-      return ref.current(...args);
-    },
+    (...args: Parameters<T>): ReturnType<T> => {},
     []
   );
killedBy: useEvent should execute the main callback
statusReason: expected "spy" to be called once, but got 0 times
