[Killed] BlockStatement
src/hooks/useFocus.ts:3:21
 import { useRef, useCallback } from "react";
 
-function useFocus() {
-  const ref = useRef<HTMLInputElement>(null);
-  const setFocus = useCallback(() => {
-    if (ref.current) {
-      ref.current.focus();
-    }
-  });
-
-  return [ref, setFocus] as const;
-}
+function useFocus() {}
 
 export default useFocus;
killedBy: useFocus should focus the input element when setFocus is called
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/hooks/useFocus.ts:5:38
 
 function useFocus() {
   const ref = useRef<HTMLInputElement>(null);
-  const setFocus = useCallback(() => {
-    if (ref.current) {
-      ref.current.focus();
-    }
-  });
+  const setFocus = useCallback(() => {});
 
   return [ref, setFocus] as const;
killedBy: useFocus should focus the input element when setFocus is called
statusReason: expected <body><div><div>…(3)</div></div></body> to be <input type="text" …(1)></input> // Object.is equality

[Killed] BlockStatement
src/hooks/useFocus.ts:6:22
 function useFocus() {
   const ref = useRef<HTMLInputElement>(null);
   const setFocus = useCallback(() => {
-    if (ref.current) {
-      ref.current.focus();
-    }
+    if (ref.current) {}
   });
 
killedBy: useFocus should focus the input element when setFocus is called
statusReason: expected <body><div><div>…(3)</div></div></body> to be <input type="text" …(1)></input> // Object.is equality

[Killed] ConditionalExpression
src/hooks/useFocus.ts:6:9
 function useFocus() {
   const ref = useRef<HTMLInputElement>(null);
   const setFocus = useCallback(() => {
-    if (ref.current) {
+    if (false) {
       ref.current.focus();
     }
killedBy: useFocus should focus the input element when setFocus is called
statusReason: expected <body><div><div>…(3)</div></div></body> to be <input type="text" …(1)></input> // Object.is equality
