[Killed] BlockStatement
src/hooks/useOnlineStatus.ts:3:35
 import { useState, useEffect } from "react";
 
-export function useOnlineStatus() {
-  const [isOnline, setIsOnline] = useState<boolean>(navigator.onLine);
-
-  useEffect(() => {
-    const handleOnline = () => setIsOnline(true);
-    const handleOffline = () => setIsOnline(false);
-
-    window.addEventListener("online", handleOnline);
-    window.addEventListener("offline", handleOffline);
-
-    return () => {
-      window.removeEventListener("online", handleOnline);
-      window.removeEventListener("offline", handleOffline);
-    };
-  });
-
-  return isOnline;
-}
+export function useOnlineStatus() {}
 
killedBy: useOnlineStatus should return initial online status based on navigator.onLine
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useOnlineStatus.ts:6:19
 export function useOnlineStatus() {
   const [isOnline, setIsOnline] = useState<boolean>(navigator.onLine);
 
-  useEffect(() => {
-    const handleOnline = () => setIsOnline(true);
-    const handleOffline = () => setIsOnline(false);
-
-    window.addEventListener("online", handleOnline);
-    window.addEventListener("offline", handleOffline);
-
-    return () => {
-      window.removeEventListener("online", handleOnline);
-      window.removeEventListener("offline", handleOffline);
-    };
-  });
+  useEffect(() => {});
 
   return isOnline;
killedBy: useOnlineStatus should update status to offline when offline event is triggered
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/hooks/useOnlineStatus.ts:7:44
   const [isOnline, setIsOnline] = useState<boolean>(navigator.onLine);
 
   useEffect(() => {
-    const handleOnline = () => setIsOnline(true);
+    const handleOnline = () => setIsOnline(false);
     const handleOffline = () => setIsOnline(false);
 
killedBy: useOnlineStatus should update status to online when online event is triggered
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/hooks/useOnlineStatus.ts:7:26
   const [isOnline, setIsOnline] = useState<boolean>(navigator.onLine);
 
   useEffect(() => {
-    const handleOnline = () => setIsOnline(true);
+    const handleOnline = () => undefined;
     const handleOffline = () => setIsOnline(false);
 

[Killed] BooleanLiteral
src/hooks/useOnlineStatus.ts:8:45
 
   useEffect(() => {
     const handleOnline = () => setIsOnline(true);
-    const handleOffline = () => setIsOnline(false);
+    const handleOffline = () => setIsOnline(true);
 
     window.addEventListener("online", handleOnline);
killedBy: useOnlineStatus should update status to offline when offline event is triggered
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/hooks/useOnlineStatus.ts:8:27
 
   useEffect(() => {
     const handleOnline = () => setIsOnline(true);
-    const handleOffline = () => setIsOnline(false);
+    const handleOffline = () => undefined;
 
     window.addEventListener("online", handleOnline);
killedBy: useOnlineStatus should update status to offline when offline event is triggered
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/hooks/useOnlineStatus.ts:11:29
     const handleOffline = () => setIsOnline(false);
 
     window.addEventListener("online", handleOnline);
-    window.addEventListener("offline", handleOffline);
+    window.addEventListener("", handleOffline);
 
     return () => {
killedBy: useOnlineStatus should not update status to online when an unrelated event is triggered
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/hooks/useOnlineStatus.ts:13:18
     window.addEventListener("online", handleOnline);
     window.addEventListener("offline", handleOffline);
 
-    return () => {
-      window.removeEventListener("online", handleOnline);
-      window.removeEventListener("offline", handleOffline);
-    };
+    return () => {};
   });
 

[Survived] StringLiteral
src/hooks/useOnlineStatus.ts:14:34
     window.addEventListener("offline", handleOffline);
 
     return () => {
-      window.removeEventListener("online", handleOnline);
+      window.removeEventListener("", handleOnline);
       window.removeEventListener("offline", handleOffline);
     };
