[Killed] BlockStatement
src/hooks/useWindowResize.ts:8:54
   height: number;
 }
 
-export function useWindowsResize(): UseWindowsResize {
-  const [windowsSize, setWindowsSize] = useState({
-    width: window.innerWidth,
-    height: window.innerHeight,
-  });
-
-  const onResize = (): void => {
-    setWindowsSize({
-      width: window.innerWidth,
-      height: window.innerHeight,
-    });
-  };
-
-  useEffect(() => {
-    window.addEventListener("resize", onResize);
-  });
-
-  return windowsSize;
-}
+export function useWindowsResize(): UseWindowsResize {}
 
killedBy: useWindowResize should instance window object
statusReason: expected undefined to strictly equal { width: 1024, height: 600 }

[Killed] BlockStatement
src/hooks/useWindowResize.ts:14:32
     height: window.innerHeight,
   });
 
-  const onResize = (): void => {
-    setWindowsSize({
-      width: window.innerWidth,
-      height: window.innerHeight,
-    });
-  };
+  const onResize = (): void => {};
 
   useEffect(() => {
killedBy: useWindowResize Should update on windows resize
statusReason: expected { width: 1024, height: 600 } to strictly equal { width: 520, height: 610 }

[Killed] BlockStatement
src/hooks/useWindowResize.ts:21:19
     });
   };
 
-  useEffect(() => {
-    window.addEventListener("resize", onResize);
-  });
+  useEffect(() => {});
 
   return windowsSize;
killedBy: useWindowResize Should update on windows resize
statusReason: expected { width: 1024, height: 600 } to strictly equal { width: 520, height: 610 }

[Killed] StringLiteral
src/hooks/useWindowResize.ts:22:29
   };
 
   useEffect(() => {
-    window.addEventListener("resize", onResize);
+    window.addEventListener("", onResize);
   });
 
killedBy: useWindowResize Should update on windows resize
statusReason: expected { width: 1024, height: 600 } to strictly equal { width: 520, height: 610 }
